# Loading Libraries

In [2]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Loading Dataset

In [32]:
df = pd.read_csv('D:\Programacion\Datasets\online_food\onlinefoods.csv')

In [35]:
df

,Age,Gender,Marital_Status,Occupation,Monthly_Income,Educational_Qualifications,Family_Size,latitude,longitude,Feedback
0,20,Female,Single,Student,No Income,Post Graduate,4,12.9766,77.5993,Positive
1,24,Female,Single,Student,Below Rs.10000,Graduate,3,12.9770,77.5773,Positive
2,22,Male,Single,Student,Below Rs.10000,Post Graduate,3,12.9551,77.6593,Negative
3,22,Female,Single,Student,No Income,Graduate,6,12.9473,77.5616,Positive
4,22,Male,Single,Student,Below Rs.10000,Post Graduate,4,12.9850,77.5533,Positive
...,...,...,...,...,...,...,...,...,...,...
383,23,Female,Single,Student,No Income,Post Graduate,2,12.9766,77.5993,Positive
384,23,Female,Single,Student,No Income,Post Graduate,4,12.9854,77.7081,Positive
385,22,Female,Single,Student,No Income,Post Graduate,5,12.9850,77.5533,Positive
386,23,Male,Single,Student,Below Rs.10000,Post Graduate,2,12.9770,77.5773,Positive
387,23,Male,Single,Student,No Income,Post Graduate,5,12.8988,77.5764,Positive

In [33]:
df.drop(['Unnamed: 12','Pin code','Output'],axis=1,inplace=True)

In [34]:
df.columns = ['_'.join(col.title().split()) if len(col.split())>1 else col for col in df.columns]

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 388 entries, 0 to 387
Data columns (total 13 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Age                         388 non-null    int64
 1   Gender                      388 non-null    object
 2   Marital_status              388 non-null    object
 3   Occupation                  388 non-null    object
 4   Monthly_income              388 non-null    object
 5   Educational_qualifications  388 non-null    object
 6   Family_size                 388 non-null    int64
 7   Latitude                    388 non-null    float64
 8   Longitude                   388 non-null    float64
 9   Pin_code                    388 non-null    int64
 10  Output                      388 non-null    object
 11  Feedback                    388 non-null    object
 12  Unnamed:_12                 388 non-null    object
dtypes: float64(2), int64(3), object(8)
memory usage: 39.5+ KB

# Cleaning data

In [13]:
# Duplicates
df.duplicated().sum()

103

In [16]:
# Invalid Values
for col in df.select_dtypes('object'):
    print(df[col].value_counts(),end='\n\n')

Gender
Male      222
Female    166
Name: count, dtype: int64

Marital_status
Single               268
Married              108
Prefer not to say     12
Name: count, dtype: int64

Occupation
Student           207
Employee          118
Self Employeed     54
House wife          9
Name: count, dtype: int64

Monthly_income
No Income          187
25001 to 50000      69
More than 50000     62
10001 to 25000      45
Below Rs.10000      25
Name: count, dtype: int64

Educational_qualifications
Graduate         177
Post Graduate    174
Ph.D              23
School            12
Uneducated         2
Name: count, dtype: int64

Output
Yes    301
No      87
Name: count, dtype: int64

Feedback
Positive     317
Negative      71
Name: count, dtype: int64

In [36]:
print(f'Min and max age: {df.Age.min()} - {df.Age.max()}')
print(f'Min and max family size: {df.Family_Size.min()} - {df.Family_Size.max()}')

Min and max age: 18 - 33
Min and max family size: 1 - 6

In [37]:
# Missing Values
df.isna().sum()

Age                           0
Gender                        0
Marital_Status                0
Occupation                    0
Monthly_Income                0
Educational_Qualifications    0
Family_Size                   0
latitude                      0
longitude                     0
Feedback                      0
dtype: int64

# EDA